# MS SQL Server

We will use this notebook to query from MS SQL Server

In [1]:
import pyodbc
import pandas as pd

In [5]:
uid = input("Enter your UID: ")
pwd = input("Enter your Password: ")

# Connect to Walton SQL Server
conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=essql1.walton.uark.edu;'
                      'Database={uid};'
                      'UID={uid};'
                      f'PWD={pwd};')

In [8]:
# Executing Queries
cursor = conn.cursor()

query = 'SELECT * FROM dbo.A1C_Store'
cursor.execute(query)

for i in cursor:
    print(i)

(0, '0 ', 'XX', 'XX', '     ', None)
(140, '2 ', 'RALEIGH', 'NC', '27616', None)
(205, '2 ', 'ST. PETERSBURG', 'FL', '33710', None)
(214, '2 ', 'PORT CHARLOTTE', 'FL', '33948', None)
(235, '2 ', 'DAYTONA BEACH', 'FL', '32114', None)
(305, '4 ', 'ST. LOUIS', 'MO', '63129', None)
(322, '4 ', 'OVERLAND PARK', 'KS', '66214', None)
(365, '4 ', 'BEACHWOOD', 'OH', '44122', None)
(406, '4 ', 'JONESBORO', 'AR', '72401', None)
(501, '5 ', 'CONWAY', 'AR', '13579', None)
(698, '6 ', 'MAUMELLE', 'AR', '72113', None)
(704, '7 ', 'FORT WORTH', 'TX', '76132', None)
(717, '7 ', 'FAIRVIEW', 'TX', '75069', None)
(718, '7 ', 'PLANO', 'TX', '75093', None)
(743, '7 ', 'LUBBOCK', 'TX', '79414', None)
(925, '9 ', 'LAS CRUCES', 'NM', '88011', None)
(926, '9 ', 'EL PASO', 'TX', '79912', None)

In [9]:
# Storing Query result into a Data Frame
df = pd.read_sql_query(query, conn)
df.head()

   STORE DIVISION            CITY STATE ZIP_CODE ZIP_SECSEG
0      0       0               XX    XX                None
1    140       2          RALEIGH    NC    27616       None
2    205       2   ST. PETERSBURG    FL    33710       None
3    214       2   PORT CHARLOTTE    FL    33948       None
4    235       2    DAYTONA BEACH    FL    32114       None